import math


a = int(input('Введите учеников А класса\n'))
b = int(input('Введите учеников Б класса\n'))
c = int(input('Введите учеников В класса\n'))
print(math.ceil(a / 2) + math.ceil(b / 2) + math.ceil(c / 2))


# a = int(input("Введите кол-во учеников в 1-ом кабинете: "))
# b = int(input("Введите кол-во учеников в 2-ом кабинете: "))
# c = int(input("Введите кол-во учеников в 3-ом кабинете: "))
# result = a // 2 + a % 2 + b // 2 + b % 2 + c // 2 + c % 2
# print(result)


# a = int(input("Введите кол-во учеников в 1-ом кабинете: "))
# b = int(input("Введите кол-во учеников в 2-ом кабинете: "))
# c = int(input("Введите кол-во учеников в 3-ом кабинете: "))
# s1 = (a + 1) // 2
# s2 = (b + 1) // 2
# s3 = (c + 1) // 2
# print(s1 + s2 + s3)